* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/* Este es un programa llamador al subprograma <b>DEP-CONN<b>
DEFINE DATA LOCAL 
  USING EMP-ALTA
END-DEFINE
*
INPUT 'INGRESE EL CODIGO DE DEPT: ' #COD-DEPT-P
CALLNAT 'DEP-CONN' #COD-DEPT-P #DESC-P #COD-RETORNO-P
WRITE '=' #COD-DEPT-P '=' #DESC-P
END
