* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** Consulta de <b>Departamentos</b>.
WRITE 'CONSULTA DEPARTAMENTO'
END  
