* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** Modificación de <b>Departamentos</b>.
WRITE 'MODIFICACIÓN DEPARTAMENTO'
END  
