DB: 012 FILE: 016  - DEPARTAMENTOS                    DEFAULT SEQUENCE: 
TYPE: ADABAS 
 
T L DB Name                              F Leng  S D Remark 
- - -- --------------------------------  - ----  - - -------------------- 
*      >Natural Source Header 000000
*      :CP
*      
*      
*      <Natural Source Header
  1 AA COD-DEPT                          A    6    D 
  1 AB DESC                              A   30  N 
******DDM OUTPUT TERMINATED****** 
