* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** Baja de <b>Empleados</b>.
WRITE 'BAJA EMPLEADO'
FETCH 'EMP-MENP'
END  
