* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** Alta de <b>Empleados</b>.
WRITE 'ALTA EMPLEADO'
FETCH 'EMP-MENP'
END  
