* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
  1 #OPCION (N01.0)
END-DEFINE
*
SET KEY ALL
INPUT USING MAP 'MEN-PRIM'
*
IF *PF-KEY EQ 'ENTR'
  DECIDE ON FIRST VALUE OF #OPCION
    VALUE 1
      FETCH 'EMP-MENP' /* MENÚ EMPLEADOS
    VALUE 2
      FETCH 'DEP-MENP' /* MENÚ DEPARTAMENTOS
    VALUE 3
      FETCH 'MON-MENP' /* MENÚ MONEDAS
    NONE VALUE
      REINPUT 'OPCIÓN INCORRECTA'
  END-DECIDE
END-IF
*
END
