* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** Listado total de <b>Monedas</b>.
DEFINE DATA LOCAL
  1 VISTA-MONEDA VIEW OF MONEDAS
    2 COD-MONEDA
    2 DESC
*
END-DEFINE
*
READ VISTA-MONEDA BY VISTA-MONEDA.COD-MONEDA
  DISPLAY 'MONEDA' VISTA-MONEDA.COD-MONEDA
          'DESC'   VISTA-MONEDA.DESC
*
END-READ
*
FETCH 'MON-MENP'
*
END
