DB: 012 FILE: 017  - MONEDAS                          DEFAULT SEQUENCE: 
TYPE: ADABAS 
 
T L DB Name                              F Leng  S D Remark 
- - -- --------------------------------  - ----  - - -------------------- 
*      >Natural Source Header 000000
*      :CP
*      
*      
*      <Natural Source Header
  1 AA COD-MONEDA                        A    3    D 
  1 AB DESC                              A   20  N 
******DDM OUTPUT TERMINATED****** 
