* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
  LOCAL USING VEH-VISL
END-DEFINE
*
READ VEHIC-VISTA BY VEHIC-VISTA.PATENTE
  DISPLAY 'PAT' VEHIC-VISTA.PATENTE
          'CHA' VEHIC-VISTA.NUMERO-CHASIS
          'ID'  VEHIC-VISTA.ID-EMPLEADO
          'MAR' VEHIC-VISTA.MARCA
          'MOD' VEHIC-VISTA.MODELO
END-READ
END
